gingerologist/nrf5_sdk_17_10/examples/ble_peripheral/ble_app_sleepmon/main.c
/*
 *  NRFX_TWIM_ENABLED         1
 *  NRFX_TWI_ENABLED          1
 *  TWI_ENABLED               1
 *  TWI1_ENABLED              1
 *  TWI0_USE_EASY_DMA	        0
 *  NRF_TWI_MNGR_ENABLED (optional, if twi_mngr is used)
 */
#define TWI1_INSTANCE_ID                1
#define TWI1_MAX_PENDING_TRANSACTIONS   4
#define QMI8658A_SCL_PIN                21      // P0.21
#define QMI8658A_SDA_PIN                19      // P0.19
#define QMI8658A_INT1_PIN               18      // P0.18
#define QMI8658A_INT2_PIN               22      // P0.22

// use twi manager instead
// static const nrf_drv_twi_t twi = NRF_DRV_TWI_INSTANCE(TWI_INSTANCE);
NRF_TWI_MNGR_DEF(m_nrf_twi_mngr, TWI1_MAX_PENDING_TRANSACTIONS, TWI1_INSTANCE_ID);
static nrf_drv_twi_config_t const qmi8658a_twi_config = {
    .scl                = QMI8658A_SCL_PIN,
    .sda                = QMI8658A_SDA_PIN,
    .frequency          = NRF_DRV_TWI_FREQ_400K,
    .interrupt_priority = TWI_DEFAULT_CONFIG_IRQ_PRIORITY,
    .clear_bus_init     = TWI_DEFAULT_CONFIG_CLR_BUS_INIT,
    .hold_bus_uninit    = TWI_DEFAULT_CONFIG_HOLD_BUS_UNINIT,
};

#define SPI0_INSTANCE_ID                0
#define SPI0_MAX_PENDING_TRANSACTIONS   4

#define KS1092_RST_PIN                  6       // P0.06
#define KS1092_SS_PIN                   7       // P0.07
#define KS1092_SCK_PIN                  8       // P0.08
#define KS1092_MISO_PIN                 17      // P0.17 (PIN20)
#define KS1092_MOSI_PIN                 18      // P0.18 (PIN21)

NRF_SPI_MNGR_DEF(m_nrf_spi_mngr, SPI0_MAX_PENDING_TRANSACTIONS, SPI0_INSTANCE_ID);
static nrf_drv_spi_config_t const ks1092_spi_config = {
    .sck_pin            = KS1092_SCK_PIN,
    .mosi_pin           = KS1092_MOSI_PIN,
    .miso_pin           = KS1092_MISO_PIN,
    .ss_pin             = KS1092_SS_PIN,
    .irq_priority       = SPI_DEFAULT_CONFIG_IRQ_PRIORITY,
    .orc                = 0xFF,
    .frequency          = NRF_DRV_SPI_FREQ_1M,
    .mode               = NRF_DRV_SPI_MODE_1, // !!! important
    .bit_order          = NRF_DRV_SPI_BIT_ORDER_MSB_FIRST
};

static nrfx_gpiote_out_config_t const ks1092_reset_pin_out_config = NRFX_GPIOTE_CONFIG_OUT_SIMPLE(true);

static ks1092_dev_t ks1092_dev = {
    .p_spi_mngr         = &m_nrf_spi_mngr,
    .p_spi_cfg          = &ks1092_spi_config,
    .reset_pin          = KS1092_RST_PIN,
    .p_reset_pin_cfg    = &ks1092_reset_pin_out_config
};

typedef enum BottomEventType
{
  BE_NONE = 0,
  BE_CONNECTED,
  BE_DISCONNECTED,
  BE_NOTIFICATION_ENABLED,
  BE_NOTIFICATION_DISABLED,
  BE_SAADC,
  BE_IMUINT2,
} BottomEventType_t;

typedef struct BottomEvent
{
  BottomEventType_t type;
  void * p_data;
} BottomEvent_t;

#define BEVENTS_IN_QUEUE      4

static TaskHandle_t           m_bottom_thread;
QueueHandle_t                 m_beq;

/* YOUR_JOB: Declare all services structure your application is using
 *  BLE_XYZ_DEF(m_xyz);
 */

// YOUR_JOB: Use UUIDs for service(s) used in your application.
static ble_uuid_t m_adv_uuids[] =                                               /**< Universally unique service identifiers. */
{
    {BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE}
};


static void advertising_start(void * p_erase_bonds);


/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    pm_handler_on_pm_evt(p_evt);
    pm_handler_disconnect_on_sec_failure(p_evt);
    pm_handler_flash_clean(p_evt);

    switch (p_evt->evt_id)
    {
        case PM_EVT_PEERS_DELETE_SUCCEEDED:
            advertising_start(false);
            break;

        default:
            break;
    }
}


/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    // Initialize timer module.
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    // Create timers.

    /* YOUR_JOB: Create any timers to be used by the application.
                 Below is an example of how to create a timer.
                 For every new timer needed, increase the value of the macro APP_TIMER_MAX_TIMERS by
                 one.
       ret_code_t err_code;
       err_code = app_timer_create(&m_app_timer_id, APP_TIMER_MODE_REPEATED, timer_timeout_handler);
       APP_ERROR_CHECK(err_code); */
}


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    ret_code_t              err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    /* YOUR_JOB: Use an appearance value matching the application's use case.
       err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_);
       APP_ERROR_CHECK(err_code); */

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


